["Anti-Mage":["Mana Break":["Description":["Burns an opponent's mana on each attack.  Mana Break deals 60% of the mana burned as damage to the target.rnrnMana Break is a Unique Attack Modifier, and does not stack with other Unique Attack Modifiers."]],"Blink":["Description":["Short distance teleportation that allows Anti-Mage to move in and out of combat."]],"Spell Shield":["Description":["Increases Anti-Mage's resistance to magic damage."]],"Mana Void":["Description":["For each point of mana missing by the target unit, damage is dealt to it and surrounding enemies.  The main target is also mini-stunned."]]],"Axe":["Berserker's Call":["Description":["Axe taunts nearby enemy units, forcing them to attack him, while he gains bonus armor during the duration."]],"Battle Hunger":["Description":["Enrages an enemy unit, causing it to be slowed and take damage over time until it kills another unit or the duration ends. Axe gains movement speed for each unit affected with Battle Hunger."]],"Counter Helix":["Description":["When attacked, Axe performs a helix counter attack, dealing damage to all nearby enemies."]],"Culling Blade":["Description":["Axe spots a weakness and strikes, instantly killing an enemy unit with low health, or dealing moderate damage otherwise. When an enemy hero is killed with Culling Blade, its cooldown is reset, and Axe and nearby allied units gain bonus movement speed.rnrnUpgradable by Aghanim's Scepter."]]],"Bane":["Enfeeble":["Description":["Weakens an enemy unit, reducing its physical damage.  Lasts 20 seconds."]],"Brain Sap":["Description":["Feasts on the vital energies of an enemy unit, healing Bane and dealing damage."]],"Nightmare":["Description":["Puts the target enemy or friendly Hero to sleep and deals damage per second.  Sleeping units are awakened when attacked, but the Nightmare passes to the attacking unit.  The nightmared unit instantly wakes up if it takes damage."]],"Fiend's Grip":["Description":["CHANNELED - Grips an enemy unit, disabling it and causing heavy damage over time, while stealing mana every second based on the unit's maximum mana.rnrnUpgradable by Aghanim's Scepter."]],"Nightmare End":["Description":["Ends all ongoing Nightmares."]]],"Bloodseeker":["Bloodrage":["Description":["Drives a unit into a bloodthirsty rage during which a unit deals, and takes, increased damage. Units affected by Bloodrage will be healed for a percentage of the max health of any units they kill. Units affected by Bloodrage when killed will heal a percentage of their max health to their killer."]],"Blood Rite":["Description":["Bloodseeker baptizes an area in sacred blood. After 3 seconds the ritual completes, causing any enemies caught in the area to take damage and become silenced."]],"Thirst":["Description":["Bloodseeker is invigorated by the wounds of his enemies, gaining bonus movement speed and attack damage whenever an enemy hero's health falls below 75%, with the bonuses increasing as their health falls further. If an enemy hero's health falls below 25%, he will also gain vision and True Sight of that hero. Bonuses stack per hero."]],"Rupture":["Description":["Causes an enemy unit's skin to rupture. If the unit moves, it takes a percentage of the distance traveled as damage.  The damage is dealt through spell immunity."]]],"Crystal_Maiden":["Crystal Nova":["Description":["A burst of damaging frost slows enemy movement and attack rate in the targeted area."]],"Frostbite":["Description":["Encases an enemy unit in ice, prohibiting movement and attack, while dealing 50 damage every half-second. Lasts 10 seconds on creeps level 6 or lower."]],"Arcane Aura":["Description":["Gives additional mana regeneration to all friendly units on the map. This bonus is increased for Crystal Maiden."]],"Freezing Field":["Description":["CHANNELED - Surrounds Crystal Maiden with random icy explosions that slow enemies and deal massive damage.  Lasts 10 seconds.rnrnUpgradable by Aghanim's Scepter."]]],"Drow_Ranger":["Frost Arrows":["Description":["Adds a freezing effect to Drow's attacks, slowing enemy movement.  Lasts 1.5 seconds on Heroes, and 7 seconds on creeps.rnrnFrost Arrows is a Unique Attack Modifier, and does not stack with other Unique Attack Modifiers."]],"Gust":["Description":["Releases a wave that silences and knocks back enemy units. Knockback distance is relative to how close they are to you."]],"Precision Aura":["Description":["Adds bonus damage to the physical attack of allied, ranged Hero units on the map based on a percentage of Drow's agility.  Affects creeps for 30 seconds when cast."]],"Marksmanship":["Description":["Drow's experiences in battle improve her accuracy and effectiveness in combat, providing a passive bonus to Agility. Grants no bonus if there are enemy heroes within 400 range.rnrnUpgradable by Aghanim's Scepter."]]],"Earthshaker":["Fissure":["Description":["Slams the ground with a mighty totem, creating an impassable ridge of stone while stunning and damaging enemy units along its line."]],"Enchant Totem":["Description":["Empowers Earthshaker's totem, causing it to deal extra damage on the next attack."]],"Aftershock":["Description":["Causes the earth to shake underfoot, adding additional damage and stuns to nearby enemy units when Earthshaker casts his abilities."]],"Echo Slam":["Description":["Shockwaves travel through the ground, damaging enemy units.  Each enemy hit causes an echo to damage nearby units.rnrnUpgradable by Aghanim's Scepter."]]],"Juggernaut":["Blade Fury":["Description":["Causes a bladestorm of destructive force around Juggernaut, rendering him immune to magic and dealing damage to nearby enemy units.  Lasts 5 seconds."]],"Healing Ward":["Description":["Summons a Healing Ward which heals all nearby allied units, based on their max health.  The Healing Ward moves at 420 movement speed after being summoned.  Lasts 25 seconds."]],"Blade Dance":["Description":["Gives Juggernaut a chance to deal double damage on each attack."]],"Omnislash":["Description":["Juggernaut leaps towards the target enemy unit with a damaging attack, and then slashes other nearby enemy units, dealing between 200-225 damage per slash.  Juggernaut is invulnerable for the duration.rnrnUpgradable by Aghanim's Scepter."]]],"Mirana":["Starstorm":["Description":["Calls down a wave of meteors to damage nearby enemy units. The closest enemy unit to Mirana in a 425 radius will be struck a second time for 75% of the damage."]],"Sacred Arrow":["Description":["Fires a long-range arrow with deadly precision, which stuns and damages the first enemy unit it strikes. The stun duration ranges from 0.01 to 5 seconds, with bonus damage up to 140 added, based on the distance the arrow travels to its target. Instantly kills the first non-ancient creep it hits."]],"Leap":["Description":["Mirana leaps forward into battle, empowering allied units with a ferocious roar that grants bonus attack and movement speed. Speed bonus lasts 10 seconds."]],"Moonlight Shadow":["Description":["Turns Mirana and all allied heroes invisible. If a hero is revealed, invisibility will restore after the fade delay as long as Moonlight Shadow's duration has not expired."]]],"Shadow_Fiend":["Shadowraze":["Description":["Shadow Fiend razes the area in front of him, dealing damage to enemy units in an area."]],"Necromastery":["Description":["Shadow Fiend steals the soul from units he kills, gaining bonus damage. If the killed unit is a hero, he gains 12 souls.  On death, he releases half of them from bondage."]],"Presence of the Dark Lord":["Description":["Shadow Fiend's presence reduces the armor of nearby enemies."]],"Requiem of Souls":["Description":["Shadow Fiend gathers his captured souls to release them as lines of demonic energy. Units near Shadow Fiend when the souls are released can be damaged by several lines of energy. Any unit damaged by Requiem of Souls will have its movement speed and attack damage reduced. Lines of energy are created for every 2 souls captured through Necromastery. Requiem of Souls is automatically cast whenever Shadow Fiend dies, regardless of its cooldown.rnrnUpgradable by Aghanim's Scepter."]]],"Morphling":["Waveform":["Description":["Morphling dissolves into liquid and surges forward, damaging enemy units in his path.  Morphling is invulnerable during Waveform."]],"Adaptive Strike":["Description":["Launches a surge of water toward an enemy unit, stunning the target while dealing base damage plus additional damage based on Morphling's agility times a multiplier.  If Morphling's agility is 50% higher than strength, the maximum damage and the minimum stun is dealt. If his strength is 50% higher than his agility, the maximum stun and minimum damage are dealt."]],"Morph (Agility Gain)":["Description":["Morphling shifts its form, pulling points from Strength and pouring them into Agility. The process is reversible.  Additional points in Morph increase the rate of stat change.  Passively grants bonus Agility."]],"Morph (Strength Gain)":["Description":["Morphling shifts its form, pulling points from Agility and pouring them into Strength. The process is reversible.  Additional points in Morph increase the rate of stat change.  Passively grants bonus Strength."]],"Hybrid":["Description":["Morphling creates a hybrid replication of a target allied hero, which can cast all of that hero's current, non-ultimate abilities. Enemies are able to see which unit is a hybrid."]],"Replicate":["Description":["Morphling replicates any hero, friend or foe, dealing 50% of the original Hero's outgoing damage while taking 100% of any incoming damage.  At any time, Morphling can instantly take the position of the Replicate for 150 mana. If Morphling dies, the Replicate will expire.rnrnUpgradable by Aghanim's Scepter."]],"Morph Replicate":["Description":["Morphling switches into his replication, instantly taking its position."]]],"Phantom_Lancer":["Spirit Lance":["Description":["Sends a magical spirit lance to a target enemy unit that damages and slows, while summoning an illusory phantom to attack the unit."]],"Doppelganger":["Description":["Phantom Lancer briefly vanishes from the battlefield. After 1 second, Phantom Lancer and any of his nearby illusions reappear at a random position within the targeted location, along with two additional doppelgangers. The two added doppelgangers have different properties: one takes normal damage and deals none, while the other takes 600% damage and deals 20% damage."]],"Phantom Rush":["Description":["When targetting an enemy for an attack, Phantom Lancer quickly charges into range. Phantom Lancer's illusions also have this ability."]],"Juxtapose":["Description":["Phantom Lancer has a chance to fracture his presence, creating an illusion of himself. Illusions also have a chance to fracture further. Illusions created from Phantom Lancer last for 8 seconds, while illusions created from other illusions last 4 seconds."]]],"Puck":["Illusory Orb":["Description":["Puck launches a magic orb that floats in a straight path, damaging enemy units along the way. At any point, Puck may teleport to the orb's location using Ethereal Jaunt."]],"Waning Rift":["Description":["Puck releases a burst of faerie dust that deals damage and silences enemy units nearby."]],"Phase Shift":["Description":["Puck briefly shifts into another dimension where it is immune from harm."]],"Ethereal Jaunt":["Description":["Teleports Puck to a flying Illusory Orb."]],"Dream Coil":["Description":["Creates a coil of volatile magic that latches onto enemy Heroes, stunning them for 0.5 seconds and damaging them.  If the enemy hero stretches the coil by moving too far away, it snaps, stunning and dealing additional damage.rnrnUpgradable by Aghanim's Scepter."]]],"Pudge":["Meat Hook":["Description":["Launches a bloody hook toward a unit or location. The hook will snag the first unit it encounters, dragging the unit back to Pudge and dealing damage if it is an enemy.rnrnUpgradable by Aghanim's Scepter, reducing the cooldown."]],"Rot":["Description":["A toxic cloud that deals intense damage and slows movement--harming not only enemy units but Pudge himself."]],"Flesh Heap":["Description":["Gives Pudge resistance to magic damage, as well as bonus strength that increases each time Pudge kills an enemy Hero or it dies in his vicinity.  Flesh Heap is retroactive, meaning it can gain charges before it is skilled, which then become active."]],"Dismember":["Description":["CHANNELED - Pudge chows down on an enemy unit, disabling it and dealing damage over time. Pudge gets healed for the same amount he damages. Lasts 3 seconds on Heroes, 6 seconds on creeps.rnrnUpgradable by Aghanim's Scepter."]]],"Razor":["Plasma Field":["Description":["Releases a wave of energetic plasma that grows in power as it expands, but also zaps on contraction, dealing damage to enemy units caught in its path. Damage increases with distance from Razor."]],"Static Link":["Description":["Creates a charged link between Razor and an enemy Hero, stealing damage from the target and giving it to Razor."]],"Unstable Current":["Description":["Razor moves with increased speed, and any abilities targeted at him are instantly countered with a jolt of electricity which damages, slows, and purges buffs from enemies."]],"Eye of the Storm":["Description":["A powerful lightning storm strikes out at enemy units with the lowest health, dealing damage and reducing their armor.rnrnUpgradable by Aghanim's Scepter."]]],"Sand_King":["Burrowstrike":["Description":["Sand King burrows into the ground and tunnels forward, damaging and stunning enemy units above him as he resurfaces.rnrnUpgradable by Aghanim's Scepter, increasing the range and applies Caustic Finale to every heroes hit by Burrowstrike."]],"Sand Storm":["Description":["CHANNELED - Sand King creates a fearsome sandstorm that damages enemy units while hiding him from vision.  The invisibility remains for a short duration after the sandstorm ends."]],"Caustic Finale":["Description":["Sand King's attacks inject a venom that causes enemy units to violently explode when its timer expires, or when the unit dies, damaging and slowing nearby enemies. Deals 50% damage if its timer expires.rnrnCaustic Finale is a Unique Attack Modifier, and does not stack with other Unique Attack Modifier."]],"Epicenter":["Description":["CHANNELED - After channeling for 2 seconds, Sand King sends a disturbance into the earth, causing it to shudder violently. All enemies caught within range will take damage and become slowed. Each subsequent pulse increases the radius of damage dealt.rnrnUpgradable by Aghanim's Scepter."]]],"Storm_Spirit":["Static Remnant":["Description":["Creates an explosively charged image of Storm Spirit that lasts 12 seconds and will detonate and deal damage if an enemy unit comes near it."]],"Electric Vortex":["Description":["A vortex that pulls an enemy unit to Storm Spirit's location, it also slows the Storm Spirit by 50% for 3 seconds."]],"Overload":["Description":["Casting a spell creates an electrical charge, which is released in a burst on his next attack, dealing damage and slowing nearby enemies."]],"Ball Lightning":["Description":["Storm Spirit becomes volatile electricity, charging across the battlefield until he depletes his mana or reaches his target. The activation mana cost is 30+8% of his total mana pool, and the cost per 100 units traveled is 12+0.7% of his total mana pool.  Damage is expressed in damage per 100 units traveled."]]],"Sven":["Storm Hammer":["Description":["Sven unleashes his magical gauntlet that deals damage and stuns enemy units."]],"Great Cleave":["Description":["Sven strikes with great force, cleaving all nearby enemy units with his attack."]],"Warcry":["Description":["Sven's Warcry heartens his allies for battle, increasing their movement speed and armor.  Lasts 8 seconds."]],"God's Strength":["Description":["Sven channels his rogue strength, granting bonus damage for 25 seconds.rnrnUpgradable by Aghanim's Scepter."]]],"Tiny":["Avalanche":["Description":["Bombards an area with rocks, stunning and damaging enemy land units."]],"Toss":["Description":["Grabs the nearest unit in a 275 radius around Tiny, ally or enemy, and launches it at the target unit or rune to deal damage where they land.  If the tossed unit is an enemy, it will take an extra 20% damage. Toss does more damage with each level in Grow."]],"Craggy Exterior":["Description":["Causes damage to bounce back on Tiny's attackers.  Enemies that attack Tiny from within 300 units have a chance of being stunned."]],"Grow":["Description":["Tiny gains craggy mass that increases his power at the cost of his attack speed. Increases Tossed unit damage and improves movement speed.rnrnUpgradable by Aghanim's Scepter."]]],"Vengeful_Spirit":["Magic Missile":["Description":["Fires a magic missile at an enemy unit, stunning and dealing damage."]],"Wave of Terror":["Description":["Vengeful Spirit lets loose a wicked cry, weakening the armor of enemies and giving vision of the path ahead."]],"Vengeance Aura":["Description":["Vengeful Spirit's presence increases the physical damage of nearby friendly units. If Vengeful Spirit is slain, her killer will be possessed with a negative Vengeance Aura, reducing the damage of her killer and its nearby allies until Vengeful Spirit revives."]],"Nether Swap":["Description":["Instantaneously swaps positions with a target Hero, friend or enemy.  Nether Swap interrupts channeling abilities on the target.rnrnUpgradable by Aghanim's Scepter."]]],"Windranger":["Shackleshot":["Description":["Shackles the target to an enemy unit or tree in a line directly behind it.  If no unit or tree is present, the stun duration is reduced to 0.75."]],"Powershot":["Description":["Windranger charges her bow for up to 1 second for a single powerful shot, which deals more damage the longer it is charged. The arrow damages enemies and destroys trees along its path. For each enemy that Powershot hits, its damage is reduced by 10%."]],"Windrun":["Description":["Increases movement speed and adds evasion from all physical attacks, while slowing movement of nearby enemies."]],"Focus Fire":["Description":["Windranger channels the wind to gain 500 additional attack speed against a single enemy unit or structure, though with a reduction to her attack damage.  Extra damage from secondary item effects is not reduced.  Lasts 20 seconds.rnrnUpgradable by Aghanim's Scepter."]]],"Zeus":["Arc Lightning":["Description":["Hurls a bolt of lightning that leaps through nearby enemy units."]],"Lightning Bolt":["Description":["Calls down a bolt of lightning to strike an enemy unit, causing damage and a mini-stun. When cast, Lightning Bolt briefly provides unobstructed vision and True Sight around the target in a 750 radius. Can be cast on the ground, affecting the closest enemy hero in 325 range."]],"Static Field":["Description":["Zeus shocks all nearby enemy units whenever he casts a spell, causing damage proportional to their current health."]],"Thundergod's Wrath":["Description":["Strikes all enemy heroes with a bolt of lightning, no matter where they may be.  Thundergod's Wrath also provides True Sight around each hero struck.  If an enemy hero is invisible, it takes no damage, but the True Sight is still created at that hero's location.rnrnUpgradable by Aghanim's Scepter."]]],"Kunkka":["Torrent":["Description":["Summons a rising torrent that, after a short delay, hurls enemy units into the sky, stunning, dealing damage and slowing movement speed."]],"Tidebringer":["Description":["Kunkka's legendary sword grants increased damage and cleaves a large area of effect in front of him for a single strike."]],"X Marks the Spot":["Description":["Targets a friendly or enemy Hero, marks their position with an X, and returns them to it after several seconds.  Kunkka can trigger the return at any time during the duration. Lasts twice as long on allied heroes."]],"Ghostship":["Description":["Summons a ghostly ship that sails through the battle before smashing apart, damaging and stunning all enemies caught near the wreckage. Allied heroes touched by the Ghostship are given a swig of The Admiral's Rum, receiving bonus movement speed and a delayed reaction to 50% of all incoming damage."]],"Return":["Description":["Returns the marked hero to the X."]]],"Lina":["Dragon Slave":["Description":["Lina channels the breath of a dragon, sending out a wave of fire that scorches every enemy in its path."]],"Light Strike Array":["Description":["Summons a column of flames that damages and stuns enemies."]],"Fiery Soul":["Description":["Grants bonus attack and movement speed each time Lina casts a spell. Stacks with itself. Lasts 10 seconds."]],"Laguna Blade":["Description":["Fires off a bolt of lightning at a single enemy unit, dealing massive damage.rnrnUpgradable by Aghanim's Scepter."]]],"Lich":["Frost Blast":["Description":["Blasts the target enemy unit with damaging frost, dealing area damage and slowing movement and attack rates for 4 seconds.  The primary target takes the most damage."]],"Ice Armor":["Description":["Creates a shield around the target friendly unit or building, which adds armor and slows attacking units. Lasts 40 seconds."]],"Sacrifice":["Description":["Sacrifices a friendly creep and converts its current hit points into mana for Lich."]],"Chain Frost":["Description":["Releases an orb of frost that bounces between nearby enemy units up to 10 times, slowing and damaging each time it hits.  The first target is mini-stunned.rnrnUpgradable by Aghanim's Scepter."]]],"Lion":["Earth Spike":["Description":["Rock spikes burst from the earth along a straight path. Enemy units are hurled into the air, then are stunned and take damage when they fall."]],"Hex":["Description":["Transforms an enemy unit into a harmless beast, with all special abilities disabled."]],"Mana Drain":["Description":["CHANNELED - Absorbs the magical energies of a target enemy unit by taking mana from it every second."]],"Finger of Death":["Description":["Rips at an enemy unit, trying to turn it inside-out. Deals massive damage.rnrnUpgradable by Aghanim's Scepter."]]],"Shadow_Shaman":["Ether Shock":["Description":["Creates a cone of ethereal energy that strikes multiple enemy units."]],"Hex":["Description":["Transforms an enemy unit into a harmless creature, disabling their attacks and abilities."]],"Shackles":["Description":["CHANNELED - Magically binds an enemy unit so that it cannot move or attack, while dealing damage over time."]],"Mass Serpent Ward":["Description":["Summons 10 serpent wards to attack enemy units and structures. The wards are immune to magic, and have a small area of splash damage that increases per level. It takes two hits to destroy a single ward.rnrnUpgradable by Aghanim's Scepter."]]],"Slardar":["Sprint":["Description":["Slardar slithers ahead, moving significantly faster and passing through units, though becoming more vulnerable to damage."]],"Slithereen Crush":["Description":["Slams the ground, stunning and damaging nearby enemy land units.  After the stun, the affected units are slowed."]],"Bash":["Description":["Grants a chance that an attack will do bonus damage and stun an enemy.  The duration is doubled against creeps."]],"Amplify Damage":["Description":["Reduces enemy armor to amplify physical damage and provides True Sight of the targeted unit, revealing invisibility."]]],"Tidehunter":["Gush":["Description":["Summons a gush of water to damage an enemy unit, reducing their movement speed and armor.  Lasts 4 seconds.rnrnUpgradable by Aghanim's Scepter, turning Gush into a ground targeted wave and decreasing cooldown."]],"Kraken Shell":["Description":["Thickens Tidehunter's hide to passively block a portion of any incoming physical attack damage. The hide also removes negative status effects if the damage taken crosses a threshold.rnrnDoes not stack with items that provide Damage Block."]],"Anchor Smash":["Description":["Tidehunter swings his mighty anchor to damage nearby enemies and reduce their attack damage."]],"Ravage":["Description":["Slams the ground, causing tentacles to erupt in all directions, damaging and stunning all nearby enemy units.rnrnUpgradable by Aghanim's Scepter."]]],"Witch_Doctor":["Paralyzing Cask":["Description":["Launches a cask of paralyzing powder that ricochets between enemy units, stunning and damaging those it hits."]],"Voodoo Restoration":["Description":["Witch Doctor focuses his magic to heal nearby allied units."]],"Maledict":["Description":["Curses all enemy Heroes in a small area, causing them to take a set amount of damage each second, as well as bursts of damage every 4 seconds based on how much health they have lost since the curse began."]],"Death Ward":["Description":["CHANNELED - Summons a deadly ward to attack enemy heroes within 700 range. Lasts a maximum of 8 seconds.rnrnUpgradable by Aghanim's Scepter."]]],"Riki":["Smoke Screen":["Description":["Throws down a smoke bomb, silencing enemies, causing causing them to miss most attacks, as well as slowing movement."]],"Blink Strike":["Description":["Teleports behind the target unit, striking for bonus damage if it is an enemy."]],"Permanent Invisibility":["Description":["Riki fades into the shadows, becoming invisible. Every time Riki strikes his enemy from behind, he deals bonus damage based on his Agility. When Riki attacks, he becomes visible."]],"Tricks of the Trade":["Description":["CHANNELED - Phases out of the world while striking every enemy from behind in a 450 AoE once per second."]]],"Enigma":["Malefice":["Description":["Focuses Enigma's power on a target, causing it to take damage and become repeatedly stunned for multiple instances.  An instance strikes every 2 seconds."]],"Demonic Conversion":["Description":["Transforms a creep into three fragments of Enigma himself.  These eidolons are all under Enigma's control, and repeated successful attacks cause them to multiply.  When this happens, the eidolons have their health restored."]],"Midnight Pulse":["Description":["Steeps an area in dark resonance, damaging enemy units based on their max HP."]],"Black Hole":["Description":["CHANNELED - Summons a vortex that sucks in nearby enemy units.  Enemies affected by Black Hole cannot move, attack, or cast spells.rnrnUpgradable by Aghanim's Scepter."]]],"Tinker":["Laser":["Description":["Fires an intense energy beam, dealing damage and blinding the target, causing it to miss all physical attacks. rnrnUpgradable by Aghanim's Scepter, causing the laser to refract between all visible enemy heroes in a 650 range."]],"Heat-Seeking Missile":["Description":["Launches a pair of rockets at the nearest visible enemy heroes within 2500 range. The number of missile targets is doubled with Aghanim's Scepter."]],"March of the Machines":["Description":["Enlists an army of robotic minions to destroy enemy units in an area around Tinker."]],"Rearm":["Description":["CHANNELED - Resets the cooldown on most of Tinker's items and abilities."]]],"Sniper":["Shrapnel":["Description":["Consumes a charge to launch a ball of shrapnel that showers the target area in explosive pellets. Enemies are subject to damage and slowed movement. Reveals the targeted area. Shrapnel charges restore every 55 seconds."]],"Headshot":["Description":["Sniper increases his accuracy, giving him a chance to deal extra damage and briefly stop the movements of his enemies."]],"Take Aim":["Description":["Extends the attack range of Sniper's rifle."]],"Assassinate":["Description":["Sniper locks onto a target enemy unit and, after 2 seconds, fires a devastating shot that deals damage at long range, and mini-stuns the target."]]],"Necrophos":["Death Pulse":["Description":["Necrophos releases a wave of death around him, dealing damage to enemy units and healing allied units."]],"Heartstopper Aura":["Description":["Necrophos stills the hearts of his opponents, causing nearby enemy units to lose a percentage of their max health over time."]],"Sadist":["Description":["Necrophos gains health and mana regeneration for every unit he kills. Hero kills grant 10 times the regen bonus."]],"Reaper's Scythe":["Description":["Stuns the target enemy hero, then deals damage based on how much life it is missing. Heroes killed by Reaper's Scythe will have 30 seconds added to their respawn timer. Any kill under this effect is credited to Necrophos.rnrnUpgradable by Aghanim's Scepter."]]],"Warlock":["Fatal Bonds":["Description":["Binds several enemy units together, causing 25% of the damage dealt to one of them to be felt by the others."]],"Shadow Word":["Description":["Warlock whispers an incantation, healing a friendly unit or damaging an enemy unit over time."]],"Upheaval":["Description":["CHANNELED - A powerful slowing current that grows stronger as it's channelled. Lasts up to 16 seconds.  Enemies are slowed for 3 seconds after leaving the area or the spell ends."]],"Chaotic Offering":["Description":["Summons a Golem from the depths, stunning enemies for one second. The Golem lives 60 seconds, takes reduced damage from spells, has Permanent Immolation and Flaming Fists on attack.rnrnUpgradable by Aghanim's Scepter."]]],"Beastmaster":["Wild Axes":["Description":["Beastmaster sends his axes flying and calls them home again, slicing through enemy units and trees along their path.  Each axe can hit an enemy once."]],"Call of the Wild: Hawk":["Description":["Beastmaster calls forth a watchful Hawk to scout the battlefield. At level 3 and beyond, the hawk can become invisible after being still for 4 seconds."]],"Call of the Wild: Boar":["Description":["Beastmaster calls a powerful Boar to stalk the battlefield, capable of spitting poison at enemies to slow their movement and attack speed."]],"Inner Beast":["Description":["Untaps the inner fury of allies, passively increasing their attack speed."]],"Primal Roar":["Description":["Beastmaster lets loose a deafening roar that stuns, and shoves open, a path to its target. All units in the path of the roar are damaged, while units shoved aside by the roar have their movement and attack speed slowed.rnrnUpgradable by Aghanim's Scepter."]]],"Queen_of_Pain":["Shadow Strike":["Description":["Hurls a poisoned dagger which deals large initial damage, and then deals damage over time. The poisoned unit has its movement speed slowed for 15 seconds.  An instance of damage is dealt every 3 seconds."]],"Blink":["Description":["Short distance teleportation that allows Queen of Pain to move in and out of combat."]],"Scream Of Pain":["Description":["The Queen of Pain lets loose a piercing scream around her, damaging nearby enemies."]],"Sonic Wave":["Description":["Creates a gigantic wave of sound in front of Queen of Pain, dealing heavy damage to all enemy units in its wake.rnrnUpgradable by Aghanim's Scepter."]]],"Venomancer":["Venomous Gale":["Description":["Launches a ball of venom in a line, poisoning enemy units so that they take both initial damage and damage over time, as well as suffering slowed movement.  Venomous Gale deals damage every 3 seconds over its duration."]],"Poison Sting":["Description":["Adds poison damage to Venomancer's normal attacks, slowing movement speed."]],"Plague Ward":["Description":["Summons a plague ward to attack enemy units and structures. The ward is immune to magic. Wards gain the Poison Sting level from Venomancer, dealing 50% of the full damage."]],"Poison Nova":["Description":["A spreading ring of poison that does damage over time to enemy units around Venomancer.  Poison Nova cannot deal lethal damage; targets will be left with at least 1 health.rnrnUpgradable by Aghanim's Scepter."]]],"Faceless_Void":["Time Walk":["Description":["Rushes to a target location while backtracking any damage taken the last 2 seconds."]],"Time Dilation":["Description":["Faceless Void traps all nearby enemies in a time dilation field for 6 seconds, freezing their cooldowns and slowing their movement and attack speed by 4% for each cooldown frozen."]],"Time Lock":["Description":["Adds the chance for an attack to lock an enemy unit in time, stunning it and dealing bonus damage."]],"Chronosphere":["Description":["Creates a blister in spacetime, trapping all units caught in its sphere of influence and causes you to move very quickly inside it.  Only Faceless Void and any units he controls are unaffected.  Invisible units in the sphere will be revealed.rnrnUpgradable by Aghanim's Scepter."]]],"Wraith_King":["Wraithfire Blast":["Description":["Wraith King sears an enemy unit with spectral fire, dealing damage and stunning, then dealing damage over time and slowing the target."]],"Vampiric Aura":["Description":["Nearby friendly units restore health based on the damage they deal when attacking enemy units."]],"Mortal Strike":["Description":["Wraith King passively gains a chance to deal bonus damage on an attack."]],"Reincarnation":["Description":["Wraith King's form regroups after death, allowing him to resurrect when killed in battle.  Upon death, enemy units in a 900 radius will be slowed.rnrnUpgradable by Aghanim's Scepter."]]],"Death_Prophet":["Crypt Swarm":["Description":["Sends a swarm of winged beasts to savage enemy units in front of Death Prophet."]],"Silence":["Description":["Prevents enemy units in a target area from casting spells."]],"Spirit Siphon":["Description":["Creates a spirit link between Death Prophet and an enemy unit, draining 20 + 1% Max HP per second and slowing the enemy's movement speed by 6%. Lasts 4 seconds."]],"Exorcism":["Description":["Unleashes evil spirits to drain the life of nearby enemy units and structures. At the end of the spell's duration, Death Prophet is healed in proportion to the damage dealt.  Lasts 30 seconds."]]],"Phantom_Assassin":["Stifling Dagger":["Description":["Throws a dagger which deals pure damage and slows the enemy unit's movement speed, while also applying attack effects from items and abilities."]],"Phantom Strike":["Description":["Teleports to a unit, friendly or enemy, and grants bonus attack speed while attacking if it's an enemy unit."]],"Blur":["Description":["Phantom Assassin focuses inward, increasing her ability to evade enemy attacks, and allowing her to blur her body to disappear from the enemy team's minimap when far from enemy heroes.rnrnStacks diminishingly with other sources of Evasion."]],"Coup de Grace":["Description":["Phantom Assassin refines her combat abilities, gaining a chance of delivering a devastating critical strike to enemy units. Stifling Dagger shares the same critical strike chance."]]],"Pugna":["Nether Blast":["Description":["An exploding pulse deals damage to enemies and structures in the area.  Deals half damage to structures."]],"Decrepify":["Description":["A powerful banishing spell that slows a unit and renders it unable to attack or be attacked. Afflicted units take extra magic damage."]],"Nether Ward":["Description":["Pugna places a Nether Ward at the target location. The ward reduces the mana regeneration of nearby enemy heroes, and will fire at any enemy hero who casts a spell. Nether Ward deals damage equal to the damage multiplier times the mana spent by the enemy hero."]],"Life Drain":["Description":["CHANNELED - When cast on an enemy, Pugna drains health from the target enemy unit to heal himself. If Pugna has full HP, and the enemy target is a Hero, Life Drain will restore mana instead.rnrnWhen cast on an ally, Pugna will drain his own health into his ally.rnrnUpgradable by Aghanim's Scepter."]]],"Templar_Assassin":["Refraction":["Description":["Templar Assassin becomes highly elusive, avoiding damage and gaining a bonus to her damage.  The damage and avoidance effects are separate, and have a limited number of instances."]],"Meld":["Description":["Templar Assassin conceals herself, becoming invisible as long as she remains still.  If Meld's invisibility is broken by attacking an enemy, Lanaya will deal bonus damage to the enemy and reduce their armor for 10 seconds."]],"Psi Blades":["Description":["Templar Assassin's psi blades slice through the attacked unit, splitting and damaging enemy units directly behind it, while gaining bonus attack range."]],"Trap":["Description":["Springs the nearest trap, slowing nearby enemies."]],"Psionic Trap":["Description":["Templar Assassin places mystical traps that invisibly monitor enemy movement. When sprung at her command, they exert a slowing influence of 30% in the area. Traps charge up to slow an additional 5% every second, up to 50%."]]],"Viper":["Poison Attack":["Description":["Intensifies Viper's venom, adding an effect to his normal attack that slows attack and movement speed while dealing damage over time.rnrnPoison Attack is a Unique Attack Modifier, and does not stack with other Unique Attack Modifiers."]],"Nethertoxin":["Description":["Nethertoxin causes Viper's normal attack to deal bonus damage to units based on how much health they are missing.  The bonus damage doubles for each 20% of health missing from the target.  Nethertoxin deals half damage to creeps and buildings."]],"Corrosive Skin":["Description":["Viper exudes an infectious toxin that damages and slows any enemy that damages it in a 1400 radius. The acid exudate also increases Viper's resistance to magic."]],"Viper Strike":["Description":["Viper slows the targeted enemy unit's movement and attack speed while also dealing poison damage over time.  The slowing effect reduces over the duration of the poison.rnrnUpgradable by Aghanim's Scepter."]]],"Luna":["Lucent Beam":["Description":["Calls a beam of lunar energy down upon an enemy, damaging and briefly stunning them."]],"Moon Glaive":["Description":["Empowers Luna's glaive, causing her attacks to bounce between enemy units. Deals less damage with each bounce."]],"Lunar Blessing":["Description":["Increases the damage dealt by attacks from Luna and nearby allied heroes. Luna is also blessed with increased vision range at night."]],"Eclipse":["Description":["Showers random nearby enemies with strikes from Luna's current level of Lucent Beam. These beams do not stun their targets, and there is a maximum number of times that a single target can be struck. Also turns day into night for 10 seconds.rnrnUpgradable by Aghanim's Scepter."]]],"Dragon_Knight":["Breathe Fire":["Description":["Unleashes a breath of fire in front of Dragon Knight that burns enemies and reduces the damage their attacks deal."]],"Dragon Tail":["Description":["Dragon Knight smites an enemy unit in melee range with his shield, stunning it while dealing minor damage.  When in Elder Dragon Form, the cast range increases to 400."]],"Dragon Blood":["Description":["The life blood of the Dragon improves health regeneration and strengthens armor."]],"Elder Dragon Form":["Description":["Dragon Knight takes the form of one of three powerful elder dragons, increasing his damage, speed, and Dragon Tail's range, while granting him new powers.rn"]]],"Dazzle":["Poison Touch":["Description":["Casts a poisonous spell on an enemy unit, gradually slowing movement, and causing damage over time.rn"]],"Shallow Grave":["Description":["An ally blessed with Shallow Grave, no matter how close to death, cannot die while under its protection."]],"Shadow Wave":["Description":["Sends out a bolt of power that arcs between allies, healing them while damaging any units standing nearby.  Dazzle is always healed by Shadow Wave."]],"Weave":["Description":["Applies a buff that increases the armor of allied heroes while decreasing the armor of enemy heroes in the target area over time.rnrnUpgradable by Aghanim's Scepter."]]],"Clockwerk":["Battery Assault":["Description":["Discharges high-powered shrapnel at random nearby enemy units, dealing minor magical damage and ministun."]],"Power Cogs":["Description":["Forms a barrier of energized cogs around Clockwerk, trapping any units that are near.  Enemies outside the trap that touch a cog are knocked back, losing health and mana. Once a cog has delivered a shock, it will power down.  Cogs can be destroyed by enemy attacks, but Clockwerk can destroy them with just one."]],"Rocket Flare":["Description":["Fires a global range flare that explodes over a given area, damaging enemies and providing vision for 10 seconds."]],"Hookshot":["Description":["Fires a grappling device rapidly at the target location.  If the hook hits a unit, Clockwerk launches himself into the target, stunning and dealing damage.  Any enemies Clockwerk collides with along the way are damaged and stunned.rnrnUpgradable by Aghanim's Scepter."]]],"Leshrac":["Split Earth":["Description":["Splits the earth under enemies. Deals damage and stuns for a short duration."]],"Diabolic Edict":["Description":["Saturates the area around Leshrac with magical explosions that deal physical damage to enemy units and structures.  The fewer units available to attack, the more damage those units will take.  Deals 40% more damage to towers.  Lasts 10 seconds."]],"Lightning Storm":["Description":["Summons a lightning storm that blasts the target enemy unit, then strikes any nearby enemy units. Struck enemies are slowed."]],"Pulse Nova":["Description":["Creates waves of damaging energy around Leshrac, one per second, to damage nearby enemy units.rnrnUpgradable by Aghanim's Scepter."]]],"Natures_Prophet":["Sprout":["Description":["Sprouts a ring of trees around a unit, trapping it in place."]],"Teleportation":["Description":["Teleports to any point on the map."]],"Nature's Call":["Description":["Converts an area of trees into Treants. Treants have 550 health and deal 30-34 damage."]],"Wrath of Nature":["Description":["Damaging energy bounces around the map, striking enemies close to the cast point that are in vision. Each enemy hit beyond the first adds damage.rnrnUpgradable by Aghanim's Scepter."]]],"Lifestealer":["Rage":["Description":["Launch into a maddened rage, becoming Spell Immune, 100% resistant to magic damage, and gaining increased attack speed."]],"Feast":["Description":["Lifestealer's attacks damage enemies and heal himself for a percentage of his target's current health."]],"Open Wounds":["Description":["Lifestealer rends an enemy unit, slowing the victim's movement speed and allowing all allies to regain health for a percentage of the damage they deal to that unit. All damage dealt will steal life, including damage from spells. The victim recovers movement speed over the duration."]],"Assimilate":["Description":["Lifestealer swallows an allied hero, allowing them to hide within him. Any healing Lifestealer receives is shared with the hero within. When an assimilated hero leaves Lifestealer, they erupt outward, damaging nearby enemies."]],"Eject":["Description":["Ejects an Assimilated hero, damaging nearby enemies."]],"Infest":["Description":["Lifestealer infests the body of a target unit, becoming undetectable inside. He can then explode from the host body, dealing damage to nearby enemies. If the infested unit is an enemy creep or a neutral creep, he can take control of the unit's ability to move and attack, and when consumed the creep will heal Lifestealer's health equal to the creep's current health.  Does not work on enemy heroes.rnrnUpgradable by Aghanim's Scepter."]],"Control":["Description":["Lifestealer seizes control of the host body's nervous system, allowing him to issue movement and attack orders from within.  Controlled units share Lifestealer's movement speed.  Cannot be used on heroes."]],"Consume":["Description":["Lifestealer eats the host body from the inside out, exploding from within."]]],"Dark_Seer":["Vacuum":["Description":["Dark Seer creates a vacuum over the target area that sucks in enemy units, disrupting them and dealing damage."]],"Ion Shell":["Description":["Surrounds the target unit with a bristling shield that damages enemy units in an area around it."]],"Surge":["Description":["Charges a target friendly unit with power, giving it a brief burst of maximum movement speed."]],"Wall of Replica":["Description":["Raises a wall of warping light that damages and creates replicas of any enemy hero who crosses it. Enemy replicas serve at the Dark Seer's will. Replicas last until they are destroyed, or until the wall's duration ends.rnrnUpgradable by Aghanim's Scepter."]]],"Clinkz":["Strafe":["Description":["Clinkz attacks with a barrage of arrows.  Dramatically increases attack speed for a short time."]],"Searing Arrows":["Description":["Imbues Clinkz's arrows with fire for extra damage."]],"Skeleton Walk":["Description":["Clinkz moves invisibly through units until the moment he attacks or uses an ability."]],"Death Pact":["Description":["Clinkz consumes the target friendly or enemy creep, gaining a percent of its hitpoints as max health and damage."]]],"Omniknight":["Purification":["Description":["Instantly heals a friendly unit and damages all nearby enemy units."]],"Repel":["Description":["Creates a divine barrier around a target unit which grants them Spell Immunity and 100% resistance to Magic Damage."]],"Degen Aura":["Description":["Greatly degenerates the movement and attack capabilities of enemy units that stray too near, including Spell Immune enemies."]],"Guardian Angel":["Description":["Omniknight summons a Guardian Angel that grants immunity from physical damage.rnrnUpgradable by Aghanim's Scepter"]]],"Enchantress":["Untouchable":["Description":["Enchantress beguiles her enemies, slowing their attacks when she is attacked.  Lasts 4 seconds."]],"Enchant":["Description":["Enchantress charms an enemy. If the enemy is a hero, they are slowed. If the enemy is a creep, she brings it under her control. If cast on a creep already under her control, she refreshes its enchant duration."]],"Nature's Attendants":["Description":["A cloud of wisps heals Enchantress and any friendly units nearby.  Lasts 10 seconds."]],"Impetus":["Description":["Places an enchantment on each attack while activated, causing it to deal additional damage based on how far away the target is.  The farther the target, the greater the damage dealt.rnrnUpgradable by Aghanim's Scepter."]]],"Huskar":["Inner Vitality":["Description":["Unlocks the regenerative power of a friendly unit, with healing based upon its primary attribute. If the target is below 40%, it will heal faster.  Lasts 16 seconds."]],"Burning Spear":["Description":["Huskar sets his spears aflame, dealing damage over time with his regular attack.  Multiple attacks will stack additional damage.  Each attack drains some of Huskar's health.  Lasts 8 seconds."]],"Berserker's Blood":["Description":["Huskar's injuries feed his power, giving increased attack speed and magic damage resistance based on missing health."]],"Life Break":["Description":["Huskar draws upon his health to break an enemy's life, leaping at a target within attack range to shatter a percentage of that hero's current health, and slowing them.  While leaping, Huskar is Spell Immune.rnrnUpgradable by Aghanim's Scepter."]]],"Night_Stalker":["Void":["Description":["Creates a damaging void that slows an enemy unit and deals damage.  Void also mini-stuns, interrupting channeling abilities. The slowing effect lasts longer at night."]],"Crippling Fear":["Description":["Night Stalker horrifies the target enemy Hero, causing it to miss attacks and become silenced.  The effect lasts longer at night."]],"Hunter in the Night":["Description":["Night Stalker is in his element at night, attacking and moving with great swiftness."]],"Darkness":["Description":["Night Stalker smothers the sun and summons instant darkness, so that he might use his powers at their fullest. While Darkness is in effect, enemy heroes, units, wards and buildings have their vision range reduced to 675. rnrnUpgradable by Aghanim's Scepter."]]],"Broodmother":["Spawn Spiderlings":["Description":["Broodmother injects her young into an enemy unit, dealing damage. The spiderlings will hatch if the target is killed while under this influence."]],"Spin Web":["Description":["Spins a large web that renders Broodmother invisible, grants a passive movement speed increase, gives free movement, and boosts regeneration while in its vicinity. Spin Web charges restore every 40 seconds. If damage is taken, free movement is disabled and the movement speed increase is halved for 6 seconds. Spin Web can be cast from anywhere as long as the new web touches an existing web. Webs never expire, and can be manually destroyed. When the maximum limit of webs is exceeded, the oldest web disappears."]],"Incapacitating Bite":["Description":["Broodmother's venom cripples enemy units, causing her attacks to slow and giving the affected unit a chance to miss its attacks."]],"Insatiable Hunger":["Description":["A violent lust for vital fluids increases Broodmother's attack damage and gives her a vampiric attack."]]],"Bounty_Hunter":["Shuriken Toss":["Description":["Hurls a deadly shuriken at an enemy unit, dealing damage and mini-stunning the target.  The shuriken will bounce between any Tracked units who are within a 1200 radius of each other."]],"Jinada":["Description":["Bounty Hunter plans his next hit, passively adding a critical strike and maim to his next attack."]],"Shadow Walk":["Description":["Bounty Hunter becomes invisible and gains the ability to move through other units until he attacks or uses an ability.  If he breaks the invisibility with an attack, that attack will deal bonus damage."]],"Track":["Description":["Tracks an enemy hero, granting True Sight of the target, and information on how much gold it is carrying. Allies near the hunted are granted bonus movement speed. If the target dies, Bounty Hunter and nearby heroes collect a bonus bounty of gold."]]],"Weaver":["The Swarm":["Description":["Weaver launches a swarm of 12 young Weavers that latch on any enemy unit in their path, attacking and reducing armor until it is killed."]],"Shukuchi":["Description":["Weaver shifts out of visibility, gaining the ability to move at maximum speed through physical units--doing harm to any enemies it passes through."]],"Geminate Attack":["Description":["Allows Weaver to dispatch two attacks at once."]],"Time Lapse":["Description":["Weaver warps backward to whatever position it was in five seconds earlier--regaining the HP and mana from that time. No effect on cooldown, gold or experience.rnrnUpgradable by Aghanim's Scepter."]]],"Jakiro":["Dual Breath":["Description":["An icy blast followed by a wave of fire launches out in a path in front of Jakiro. The ice slows enemies, while the fire delivers damage over time."]],"Ice Path":["Description":["Creates a path of ice that stuns and damages enemies that touch it."]],"Liquid Fire":["Description":["Jakiro burns his enemies in an area of effect with fire added to his attack, while slowing their attacks.rnrnLiquid Fire is a Unique Attack Modifier, and does not stack with other Unique Attack Modifiers."]],"Macropyre":["Description":["Jakiro exhales a wide line of lasting flames, which deals damage per second to any enemy units caught in the fire.rnrnUpgradable by Aghanim's Scepter."]]],"Batrider":["Sticky Napalm":["Description":["Drenches an area in sticky oil, amplifying damage from Batrider's attacks and abilities and slowing the movement speed and turn rate of enemies in the area.  Additional casts of Sticky Napalm continue to increase damage, up to 10 stacks.  The extra damage is halved against creeps."]],"Flamebreak":["Description":["Hurls an explosive cocktail that explodes when it reaches the target location, knocking back, briefly stunning, and dealing damage over time to enemies in the area."]],"Firefly":["Description":["Batrider takes to the skies, laying down a trail of flames from the air.  The fire damages any enemies it touches, and destroys trees below Batrider. While flying, Batrider gains unobstructed movement and vision."]],"Flaming Lasso":["Description":["Lassoes an enemy and drags them in Batrider's wake.  Victims cannot be dragged over impassable terrain. Dragged units cannot move, attack, or use abilities.  Teleporting or blinking will break the lasso.rnrnUpgradable by Aghanim's Scepter."]]],"Chen":["Penitence":["Description":["Forces an enemy unit to move slower and take more damage from attacks and spells."]],"Test of Faith":["Description":["Teleports an allied unit back to the base.  Creeps are teleported instantly, while Heroes have a delay before teleporting. If cast on Chen, all units controlled by Chen through Holy Persuasion will be teleported to him after a delay."]],"Holy Persuasion":["Description":["Chen takes control of an enemy or neutral creep. If the persuaded creep's base health is naturally below the health minimum, its base health will be raised to the health minimum.rnrnUpgradable by Aghanim's Scepter, allowing Chen to persuade Ancient Creeps. The number of Ancient Creeps that can be persuaded is based on the level of Hand of God."]],"Hand of God":["Description":["Fully regenerates any creeps under Chen's control and heals all allied heroes on the map.rnrnUpgradable by Aghanim's Scepter."]]],"Spectre":["Spectral Dagger":["Description":["Spectre flings a dagger to draw a Shadow Path, dealing damage and slowing the movement speed of any enemies along the trail. Units hit by the dagger also trail a Shadow Path. While treading the path, Spectre phases through otherwise impassable terrain."]],"Desolate":["Description":["Deals bonus damage whenever Spectre attacks an enemy who is alone."]],"Dispersion":["Description":["Damage done to Spectre is reflected on her enemies, leaving her unharmed. The effect lessens with distance."]],"Reality":["Description":["Spectre exchanges places with a chosen Haunt."]],"Haunt":["Description":["Creates a spectral nemesis to attack each enemy hero after a short delay. At any moment during the duration, Spectre can use Reality to exchange places of a given haunt.rnrnHaunt illusions are uncontrollable, take extra damage, and deal less damage than Spectre herself.  They move at 400 base movement speed and ignore terrain."]]],"Doom":["Devour":["Description":["Consumes an enemy or neutral creep, acquiring any special abilities that it possessed."]],"Scorched Earth":["Description":["Carpets the nearby earth in flames which damage enemies and heal Doom, while also granting him increased movement speed."]],"Infernal Blade":["Description":["Doom swings his burning sword, igniting the enemy. Stuns for %ministun_durations% seconds and applies a 4 second burn that deals 40 + 1.25% of the target's Max HP as damage per second."]],"Doom":["Description":["Inflicts a curse that prevents an enemy Hero from casting spells or using items, while taking damage over time.rnrnUpgradable by Aghanim's Scepter."]]],"Ancient_Apparition":["Cold Feet":["Description":["Places a frozen hex on an enemy unit that deals damage over time, but can be dispelled by moving away from the initial cast point.  If the enemy unit doesn't move outside of the given range, it will be stunned and frozen in place after 4 seconds."]],"Ice Vortex":["Description":["Creates a vortex of icy energy that slows movement speed and increases magic damage done in its range.  Lasts 16 seconds."]],"Chilling Touch":["Description":["A frigid gust enchants allied heroes, granting them bonus magical damage for a given number of physical attacks, while slowing their attack speed slightly.  Ancient Apparition always receives the buff. Lasts 30 seconds."]],"Ice Blast":["Description":["Launches a tracer toward any location on the battlefield, which must be triggered again to mark the area to be blasted by a damaging explosion of hail. The further the tracer travels, the larger the explosion will be. Enemies caught in the explosion, or who touch the icy ball of hail as it travels, are Frostbitten, taking damage and prevented from regenerating or healing. If a Frostbitten unit's health drops below a certain percentage, they will instantly shatter.rnrnUpgradable by Aghanim's Scepter."]],"Release":["Description":["Releases the ice blast to explode at the tracer's current location."]]],"Ursa":["Earthshock":["Description":["Ursa slams the earth, causing a powerful shock to damage and slow all enemy units in a nearby area for 4 seconds."]],"Overpower":["Description":["Using his skill in combat, Ursa gains increased attack speed for a number of subsequent attacks."]],"Fury Swipes":["Description":["Ursa's claws dig deeper wounds in the enemy, causing consecutive attacks to the same enemy to deal more damage.  If the same target is not attacked after 15 seconds, the bonus damage is lost."]],"Enrage":["Description":["Ursa goes into a frenzy, multiplying his Fury Swipes damage and causing him to take 80% less damage. Removes any existing debuffs.rnrnUpgradable by Aghanim's Scepter."]]],"Spirit_Breaker":["Charge of Darkness":["Description":["Spirit Breaker fixes his sight on an enemy unit and starts charging through all objects.  All enemy units passed through and the targeted unit will be hit by a Greater Bash.  If the targeted unit dies, Spirit Breaker will change his target to the nearest enemy unit to that location."]],"Empowering Haste":["Description":["Causes Spirit Breaker to gain power with higher movement speed. His presence increases the movement speed of nearby allied units. Can be cast to improve the movement speed bonus for 6 seconds, however afterward the passive bonus will be halved while the ability is on cooldown."]],"Greater Bash":["Description":["Gives a chance to stun and knockback an enemy unit on an attack, as well as gaining bonus movement speed after a bash occurs. Deals a percentage of movement speed as damage."]],"Nether Strike":["Description":["Spirit Breaker slips into the nether realm, reappearing next to his hapless victim. Upon reappearing, a Greater Bash of the current level occurs and deals bonus damage.rnrnUpgradable by Aghanim's Scepter."]]],"Gyrocopter":["Rocket Barrage":["Description":["Launches a salvo of rockets at nearby enemy units in a radius around the Gyrocopter.  Lasts 3 seconds."]],"Homing Missile":["Description":["Fires a homing missile to seek the targeted enemy unit. The missile gains speed over time, dealing damage and stunning when it impacts the target.  Homing Missile deals greater damage the further it has traveled.  Enemy units can destroy the missile before it reaches its target."]],"Flak Cannon":["Description":["Gyrocopter's attacks hit all enemy units in an area around it for a limited number of attacks.  Only the main target of attacks will receive attack bonuses such as Critical Strike.  Lasts 15 seconds or until the attacks are used."]],"Call Down":["Description":["Call down an aerial missile strike on enemy units in a target area.  Two missiles arrive in succession, the first dealing major damage and minor slow for 2 seconds; the second dealing minor damage and major slow for 4 seconds.rnrnUpgradable by Aghanim's Scepter."]]],"Alchemist":["Acid Spray":["Description":["Sprays high-pressure acid across a target area. Enemy units who step across the contaminated terrain take damage per second and have their armor reduced."]],"Unstable Concoction":["Description":["Alchemist brews up an unstable concoction that he can throw at an enemy hero, to stun and deal damage in an area around the explosion. The longer the concoction brews, the more damage it deals and the longer the stun. After 5 seconds, the brew reaches its maximum damage and stun time. However, after 5.5 seconds, the concoction will explode on Alchemist himself if not thrown."]],"Greevil's Greed":["Description":["Alchemist synthesizes additional gold from his enemies and bounty runes. With each kill, Alchemist earns base bonus gold and extra bonus gold. If Alchemist kills another unit which yields gold within the next 30 seconds, an additional instance of Extra Bonus Gold is added to the total. Additionally, causes bounty runes to yield 3 times their normal gold."]],"Chemical Rage":["Description":["Alchemist causes his Ogre to enter a chemically induced rage, reducing base attack cooldown and increasing movement speed and regeneration."]],"Unstable Concoction Throw":["Description":["Throw it before it blows up!"]]],"Invoker":["Quas":["Description":["Allows manipulation of ice elements and grants a permanent strength bonus. Each "]],"Wex":["Description":["Allows manipulation of storm elements and grants a permanent agility bonus. Each "]],"Exort":["Description":["Allows manipulation of fire elements and grants a permanent intelligence bonus. Each "]],"Invoke":["Description":["Combines the properties of the elements currently being manipulated to create a new spell for Invoker to use.  Click the help button to see the list of possible spells.rnrnUpgradable by Aghanim's Scepter."]],"Cold Snap":["Description":["Invoker draws the heat from an enemy, chilling them to their very core for a duration based on the level of "]],"Ghost Walk":["Description":["Invoker manipulates the ice and electrical energies around him, rendering his body invisible. The elemental imbalance created as a consequence slows nearby enemies based on the level of "]],"Tornado":["Description":["Unleashes a fast moving tornado that picks up enemy units in its path, suspending them helplessly in the air shortly before allowing them to plummet to their doom. Travels further based on the level of "]],"EMP":["Description":["Invoker builds up a charge of electromagnetic energy at a targeted location which automatically detonates after %delay% seconds. The detonation covers an area, draining mana based on the level of "]],"Alacrity":["Description":["Invoker infuses an ally with an immense surge of energy, increasing their attack speed based on the level of "]],"Chaos Meteor":["Description":["Invoker pulls a flaming meteor from space onto the targeted location. Upon landing, the meteor rolls forward, constantly dealing damage based on the level of "]],"Sun Strike":["Description":["Sends a catastrophic ray of fierce energy from the sun at any targeted location, incinerating all enemies standing beneath it once it reaches the earth. Deals damage based on the level of "]],"Forge Spirit":["Description":["Invoker forges a spirit embodying the strength of fire and fortitude of ice. Damage, health, and armor are based on the level of "]],"Ice Wall":["Description":["Generates a wall of solid ice directly in front of Invoker for a duration based on the level of "]],"Deafening Blast":["Description":["Invoker unleashes a mighty sonic wave in front of him, dealing damage to any enemy unit it collides with based on the level of "]],"invoker_attribute_bonus":["Description":["DOTA_Tooltip_ability_invoker_attribute_bonus_Description"]]],"Silencer":["Arcane Curse":["Description":["Curses the target area, causing enemy heroes to take damage. Anytime affected enemies cast a spell, the duration is increased."]],"Glaives of Wisdom":["Description":["Silencer enchants his glaives with his wisdom, dealing additional damage based on his Intelligence."]],"Last Word":["Description":["Enchants a target, causing them to be damaged, silenced, and their movement speed slowed if they cast a spell or if the enchantment timer expires."]],"Global Silence":["Description":["Silencer stops all sound, preventing enemy heroes and units on the map from casting spells.rnrnUpgradable by Aghanim's Scepter."]]],"Outworld_Devourer":["Arcane Orb":["Description":["Adds extra pure damage to Outworld Devourer's attacks, based on his remaining mana pool. Steals 0 intelligence for 40 seconds per hit when attacking an enemy hero. Arcane Orb also does bonus damage to summoned units and illusions.rnrnArcane Orb is a Unique Attack Modifier, and does not stack with other Unique Attack Modifiers."]],"Astral Imprisonment":["Description":["Places a target unit into an astral prison. The hidden unit is invulnerable and disabled. When the astral prison implodes, it deals 75 damage to enemies in a 400 radius around the target."]],"Essence Aura":["Description":["Whenever nearby allied Heroes or Outworld Devourer itself casts a spell, it gains a chance to restore a percentage of its mana pool.  Outworld Devourer also passively gains a bonus to its base mana pool.  Several skills with no cooldown and toggled spells cannot trigger Essence Aura."]],"Sanity's Eclipse":["Description":["Unleashes a psychic blast that removes 40% of the mana from affected heroes, while also damaging them based on the difference between the affected hero's Intelligence and Outworld Devourer's. If an enemy hero has the same or higher Intelligence than Outworld Devourer, Sanity's Eclipse will not cause damage. Sanity's Eclipse can hit units trapped by Astral Imprisonment.rnrnUpgradable by Aghanim's Scepter."]]],"Lycan":["Summon Wolves":["Description":["Summons two wolves to fight for Lycan.  Level 2-4 wolves have Cripple, level 3-4 wolves have permanent invisibility, and level 4 wolves have 15 HP regen."]],"Howl":["Description":["Grants bonus damage to Lycan, all allied heroes and all units under their control."]],"Feral Impulse":["Description":["Increases the damage and attack speed of Lycan and all units under his control."]],"Shapeshift":["Description":["Lycan assumes his lupine form, granting him and his units critical strikes and added vision at night. During Shapeshift, Lycan and all units under his control move at increased speed, cannot be slowed and have a 40% chance to deal a critical strike doing 140% damage."]]],"Brewmaster":["Thunder Clap":["Description":["Slams the ground, dealing damage and slowing the movement speed and attack rate of nearby enemy land units."]],"Drunken Haze":["Description":["Drenches a small area in alcohol, causing their movement speed to be reduced, and causing their attacks to have a chance to miss."]],"Drunken Brawler":["Description":["Gives a chance to avoid attacks and to deal critical damage. Drunken Brawler will always trigger if you have not attacked, or have not been attacked, in the last several seconds.rnrnStacks diminishingly with other sources of Evasion."]],"Primal Split":["Description":["Splits Brewmaster into elements, forming 3 specialized warriors, adept at survival. If any of them survive until the end of their summoned timer, the Brewmaster is reborn.rnrnUpgradable by Aghanim's Scepter."]]],"Shadow_Demon":["Disruption":["Description":["Banishes the targeted unit from the battlefield for a short duration.  Upon returning, two illusions of the banished unit are created under Shadow Demon's control."]],"Soul Catcher":["Description":["Curses a random enemy in an area to take increased damage.  Units under the effect of Disruption can still be affected by Soul Catcher."]],"Shadow Poison":["Description":["Deals damage in a line, and afflicts enemy units with a poison effect. The poison deals 1/2/4/8/16 times the stack damage based on the number of stacks on the target, up to 5 stacks. Additional stacks cause 50 damage each.  This deferred damage is dealt when Shadow Poison's duration is expired, or the Release sub-ability is used."]],"Shadow Poison Release":["Description":["Releases the poison to do damage on all affected enemies. Units under the effect of Disruption can still be affected by Shadow Poison."]],"Demonic Purge":["Description":["Purges the target enemy unit, removing positive buffs, and slowing the target for the duration.  The unit slowly regains its speed until the end of the duration, upon which damage is dealt.  Units under the effect of Disruption can still be affected by Demonic Purge.rnrnUpgradable by Aghanim's Scepter."]]],"Lone_Druid":["Summon Spirit Bear":["Description":["Summons a powerful Spirit Bear companion that can equip items.  If the bear moves 1100 distance away from the Lone Druid, it cannot attack.  Lone Druid suffers 10% of his max health as backlash damage if the Spirit Bear dies.  As the bear increases in levels, it can learn the Return, Entangling Claws, and Demolish abilities.  Spirit Bear does not benefit from attributes.rnrnUpgradable by Aghanim's Scepter, allowing Spirit Bear to attack at any range from Lone Druid, and to survive if Lone Druid dies."]],"Rabid":["Description":["Increases the attack and movement speed of Lone Druid and the Spirit Bear."]],"Savage Roar":["Description":["Lone Druid roars fiercely causing nearby enemies to flee towards their base in terror. Their movement speed is increased by 20%."]],"Battle Cry":["Description":["Adds attack damage and armor to the Lone Druid as well as any nearby units under his control."]],"True Form":["Description":["Lone Druid learns to morph himself into a raging bear, losing his ranged advantage and some base movement speed, but gaining melee power as well as the Battle Cry ability.  He can morph freely between druid and bear form.rnrnUpgradable by Aghanim's Scepter."]],"Druid Form":["Description":["Return to Druid form.rnrnUpgradable by Aghanim's Scepter."]]],"Chaos_Knight":["Chaos Bolt":["Description":["Throws a mysterious bolt of energy at the target unit. It stuns for a random duration and deals random damage."]],"Reality Rift":["Description":["Teleports you, any images you have and the target unit to a random point along the line between the two of you. Gives you bonus attack damage for one attack."]],"Chaos Strike":["Description":["Each of Chaos Knight's attacks has a chance to deal bonus damage and reduce the target's armor by 5 for 8 seconds."]],"Phantasm":["Description":["Summons several phantasmal copies of the Chaos Knight from alternate dimensions. There is a 50% chance an extra phantasm will be summoned. The phantasms deal full damage, but take double damage."]]],"Meepo":["Earthbind":["Description":["Tosses a net at the target point, pinning down all enemy units.  Earthbind prevents invisibility, blink, and interrupts channeling."]],"Poof":["Description":["Drawing mystical energies from the earth, a Meepo can teleport to another Meepo or itself after channeling for 1.5 seconds, dealing damage in both the departure and arrival locations."]],"Geostrike":["Description":["Meepo enchants his weapon to deal damage per second, as well as slow the movement speed of the attacked unit.  Geostrikes from multiple Meepos stack."]],"Divided We Stand":["Description":["Meepo summons an imperfect, semi-autonomous duplicate of himself, which can gain gold and experience as he does and shares his experience and abilities. However, the clones cannot wield any items but the boots that Meepo himself wears.  If any of the clones die, they all die.rnrnUpgradable by Aghanim's Scepter."]]],"Treant_Protector":["Nature's Guise":["Description":["Causes the targeted unit to blend in with the forest, becoming invisible to enemies and gaining a movement speed bonus when near a tree.  If the unit moves away from a tree or the spell is cast on a unit with no nearby trees, Nature's Guise is lost.  Treant Protector can cast spells and remain invisible under Nature's Guise."]],"Leech Seed":["Description":["Treant plants a life-sapping seed in an enemy unit, draining its health, while simultaneously slowing it. The seed heals friendly units around it.  Pulses 6 times."]],"Living Armor":["Description":["Infuses the target hero or structure with a protective coating which grants bonus regeneration. Also blocks some damage from all sources. Dispels when a number of damage instances are taken."]],"Eyes In The Forest":["Description":["Treant Protector enchants a tree, which grants him unobstructed vision in that location. If Overgrowth is cast, units within a 800 radius of an enchanted tree will be entangled and damaged."]],"Overgrowth":["Description":["Summons an overgrowth of vines and branches around Treant that prevent afflicted enemies from moving, blinking, going invisible, or attacking.rnrnUpgradable by Aghanim's Scepter."]]],"Ogre_Magi":["Fireblast":["Description":["Blasts an enemy unit with a wave of fire, dealing damage and stunning the target."]],"Ignite":["Description":["Drenches a target in volatile chemicals, causing it to burst into flames. The target is in immense pain, taking damage and moving more slowly."]],"Bloodlust":["Description":["Incites a frenzy in a friendly unit, increasing its movement speed and attack speed. Can be cast on towers."]],"Unrefined Fireblast":["Description":["Blasts an enemy unit with a wave of fire, dealing damage and stunning the target. Its mana cost is 60% of the hero's current mana."]],"Multicast":["Description":["Enables Ogre Magi to cast his spells multiple times with each use, while also granting his spells greater potency:rn"]]],"Undying":["Decay":["Description":["Undying steals strength from all enemy heroes in an area, dealing base damage as he claims the enemy's strength for himself.rnrnUpgradable by Aghanim's Scepter, increasing Decay's strength steal."]],"Soul Rip":["Description":["Undying rips health away from all nearby units and uses it to heal an ally, or damage an enemy. Soul Rip can also be used to heal Tombstone."]],"Tombstone":["Description":["Summons a tombstone at the target point.  Zombies will frequently spawn next to every enemy unit in the area around the Tombstone, and attack them.  Zombies have the Deathlust ability, which causes their attacks to slow the target, and if the target reaches below a certain amount of health, increases the attack and movement speed of the zombie."]],"Flesh Golem":["Description":["Undying transforms into a horrifying flesh golem that possesses a Plague Aura.  This aura slows all enemy units within 750 range and amplifies the damage they take; the closer to Undying, the more damage and slow.  When a plagued unit dies, Undying is healed equal to a percentage of his own maximum health."]]],"Rubick":["Telekinesis":["Description":["Rubick uses his telekinetic powers to lift the enemy into the air briefly and then hurls them back at the ground. The unit lands on the ground with such force that it stuns nearby enemies."]],"Telekinesis Land":["Description":["Chooses the location the target will land when Telekinesis finishes."]],"Fade Bolt":["Description":["Rubick creates a powerful stream of arcane energy that travels between enemy units, dealing damage and reducing their attack damage.  Each jump deals less damage."]],"Null Field":["Description":["Rubick's mastery of the arcane protects nearby allies against weaker magics, granting them magic resistance."]],"Spell Steal":["Description":["Rubick studies the trace magical essence of one enemy hero, learning the secrets of the last spell the hero cast. Rubick can use this spell as his own for several minutes or until he dies.rnrnUpgradable by Aghanim's Scepter."]]],"Disruptor":["Thunder Strike":["Description":["Repeatedly strikes the targeted unit with lightning.  Each strike damages nearby enemy units in a small radius.  Provides vision of its target."]],"Glimpse":["Description":["Teleports the target hero back to where it was 4 seconds ago.  Instantly kills illusions."]],"Kinetic Field":["Description":["After a short formation time, creates a circular barrier of kinetic energy that enemies can't pass."]],"Static Storm":["Description":["Creates a damaging static storm that also silences all enemy units in the area for the duration.  The damage starts off weak, but increases in power over the duration.rnrnUpgradable by Aghanim's Scepter."]]],"Nyx_Assassin":["Impale":["Description":["Rock spikes burst from the earth along a straight path. Enemy units are hurled into the air, then are stunned and take damage when they fall."]],"Mana Burn":["Description":["Destroys the target hero's mana equal to a multiplier of its Intelligence, and deals damage equal to the mana burned."]],"Spiked Carapace":["Description":["When activated while above ground, Spiked Carapace reflects and negates damage dealt to Nyx Assassin (max once from each source), as well as stunning the source of the damage. Activating Spiked Carapace will not break Vendetta invisibility.rnrnWhile Burrowed, Spiked Carapace instantly stuns nearby enemies when cast."]],"Burrow":["Description":["Nyx Assassin buries himself beneath the battlefield over 1 second. Once burrowed, Spiked Carapace instantly stuns nearby enemies when cast, the range of Mana Burn and Impale is increased by 75%, and Impale's cooldown is decreased. While burrowed, Nyx Assassin is stationary, unable to attack, and invisible. His health and mana regeneration are also increased, and he gains 40% damage reduction."]],"Unburrow":["Description":["Emerge from the burrow."]],"Vendetta":["Description":["Allows Nyx Assassin to become invisible and gain a speed bonus.  If Nyx Assassin attacks to break the invisibility, massive bonus damage is dealt with the attack.rnrnUpgradable by Aghanim's Scepter."]]],"Naga_Siren":["Mirror Image":["Description":["Creates three images of Naga Siren under her control."]],"Ensnare":["Description":["Interrupts the target and traps them in place, preventing movement or blinking."]],"Rip Tide":["Description":["The Naga Siren and her images hit all nearby units with a damaging wave of water that lowers armor for 8 seconds."]],"Song of the Siren":["Description":["All enemies in range of the Naga Siren are put into a magical stasis where they cannot act or be attacked. Using Song of the Siren again will end the duration early.rnrnUpgradable by Aghanim's Scepter."]],"Song of the Siren End":["Description":["Release enemy units from your song so they can be targeted again."]]],"Keeper_of_the_Light":["Illuminate":["Description":["Channels light energy, building power the longer it's channeled.  Once released, a wave is sent forth that deals damage and gives vision in its path.  The longer it is channeled, the more damage is dealt.rnrnUpgradable by Aghanim's Scepter, allowing Illuminate to heal allies and harm enemies during daytime. The heal and damage amounts are the same."]],"Mana Leak":["Description":["Weakens an enemy's magical essence, causing them to lose mana as they move.  If the enemy loses all of its mana, it will be stunned."]],"Chakra Magic":["Description":["Restores mana to the target unit, increases its mana capacity, and reduces the cooldown of the next spell they cast."]],"Recall":["Description":["After a short delay, teleports the targeted friendly hero to your location.  If the targeted friendly hero takes player based damage during this time, the ability is interrupted."]],"Blinding Light":["Description":["A blinding light flashes over the targeted area, knocking back and blinding the units in the area, causing them to miss attacks."]],"Spirit Form":["Description":["Ezalor temporarily turns his body luminescent, gaining various abilities.  Illuminate is now channeled by a separate spirit, and gains the Blinding Light and Recall abilities.rnrnUpgradable by Aghanim's Scepter."]],"Release Illuminate":["Description":["Release the channel early."]]],"Io":["Tether":["Description":["Tethers Io to an allied unit, granting bonus movement speed to both. When Io restores health or mana, tethered units target gain 1.5x the amount. Any enemy unit that crosses the tether is slowed. The tether breaks when the allied unit moves too far away, or Io cancels the tether."]],"Break Tether":["Description":["Break the link to the tethered unit."]],"Spirits":["Description":["Summon five particle spirits that dance in a circle around Io. If a particle collides with an enemy hero, it explodes, damaging all enemy units in an area around it.  Creeps take minor damage from touching a particle spirit, but do not cause them to explode.  When its duration ends, any remaining Spirits explode."]],"Overcharge":["Description":["Io gains bonus attack speed and damage reduction, at the cost of draining a percentage of its current health and mana per second.  If Io is Tethered to an ally, that unit also gains the bonuses."]],"Relocate":["Description":["Teleports Io and any tethered ally to any location. After the spell expires Io and any tethered ally will return to their original location. Double-click to teleport to your team's base fountain."]],"Spirits In":["Description":["Calls the spirits closer to you. Can be toggled on and off."]],"Spirits Out":["Description":["Sends the spirits farther away from you. Can be toggled on and off."]]],"Visage":["Grave Chill":["Description":["Visage drains the movement and attack speed of the targeted unit, gaining it for itself."]],"Soul Assumption":["Description":["Visage gathers charges of soul essence each time nearby heroes take more than 110 damage. When the essence is released, it deals base damage as well as damage for each gathered soul charge."]],"Gravekeeper's Cloak":["Description":["Visage generates a layered barrier that protects him from physical and magical attacks.  If he receives damage from a player, one layer is removed, and takes time to recover."]],"Summon Familiars":["Description":["Conjures two blind Familiars to fight for Visage.  Familiars have high attack power, but each attack drains a charge of damage that recharges slowly over time.  Familiars possess the Stone Form ability, that allows them to turn into stone, stunning enemies upon landing.  While in Stone Form, Familiars are invulnerable, and rapidly regenerate their health and damage.  Familiars grant high bounty when killed.rnrnUpgradable by Aghanim's Scepter."]]],"Slark":["Dark Pact":["Description":["After a short delay, Slark sacrifices some of his life blood, purging most negative debuffs and dealing damage to enemy units around him and to himself.  Slark only takes 50% of the damage."]],"Pounce":["Description":["Slark leaps forward, grabbing the first hero he connects with.  That unit takes damage and is leashed to Slark, and can only move a limited distance away from Slark's landing position."]],"Essence Shift":["Description":["Slark steals the life essence of enemy heroes with his attacks, draining each of their attributes and converting them to bonus Agility."]],"Shadow Dance":["Description":["When used, Slark hides himself in a cloud of shadows, becoming immune to detection. Attacking, casting spells, and using items will not reveal Slark.  Passively, when not visible to the enemy team, Slark gains bonus movement speed and health regeneration."]]],"Medusa":["Split Shot":["Description":["Medusa magically splits her shot into several arrows. These arrows deal a lower percent of her normal damage.rnrnThe extra targets will not receive other attack effects (such as critical strike) and Unique Attack Modifiers."]],"Mystic Snake":["Description":["A mystic snake made of energy jumps from target to target dealing damage and stealing mana. After it reaches its last target, it returns to Medusa to replenish her with mana. The snake deals more damage per jump and steals 11% of the targets' total mana. Deals Pure damage to units petrified by Stone Gaze."]],"Mana Shield":["Description":["Creates a shield that absorbs 60% of the incoming damage in exchange for Medusa's mana."]],"Stone Gaze":["Description":["Any enemy units looking at Medusa will have their movement and attack speed slowed.  If 2 seconds of total time is accumulated looking at Medusa while Stone Gaze is active, that unit will turn to stone.  Petrified units are stunned, have 100% magic damage resistance, and take bonus physical damage.  If the petrified unit is an illusion, it is immediately killed."]]],"Troll_Warlord":["Berserker's Rage":["Description":["While active, Troll Warlord swaps from using ranged to melee attacks. Melee attacks have a chance to bash, dealing bonus damage and stunning the target. Berserker's Rage also grants additional health, movement speed, armor, and increased attack speed.rnrnWhirling Axes has different functionality while Berserker's Rage is active."]],"Whirling Axes (Ranged)":["Description":["Troll hurls a fistful of five axes in a cone shape over 900 range, slowing and damaging enemy units."]],"Whirling Axes (Melee)":["Description":["Troll hurls two axes around him in a close range area of effect, damaging enemy units and causing them to miss some attacks."]],"Fervor":["Description":["With each continuous blow on the same target, Troll gains increased attack speed.  If Troll changes targets, the stacks drop to zero."]],"Battle Trance":["Description":["Troll's presence on the battlefield increases the attack speed of himself and all allied heroes."]]],"Centaur_Warrunner":["Hoof Stomp":["Description":["Slams the ground, stunning and damaging nearby enemy units."]],"Double Edge":["Description":["Centaur strikes a mighty blow at melee range, damaging both himself and a small area around the target.  Centaur cannot die from Double Edge."]],"Return":["Description":["Centaur counters every attack, damaging the attacker based on a percentage of Centaur's strength."]],"Stampede":["Description":["Centaur leads all allies into a vicious charge causing them to move through units at max speed and stop any enemy units they trample. Trampled enemies take damage based on Centaur Warrunner's strength. Each enemy can be trampled once.rnrnUpgradable by Aghanim's Scepter."]]],"Magnus":["Shockwave":["Description":["Magnus sends out a wave of force, damaging enemy units in a line."]],"Empower":["Description":["Gives an allied unit bonus damage and cleave on attack.rnrnUpgradable by Aghanim's Scepter, changing Empower to be an allied hero aura. Affects ranged heroes for half values and causes them to splash around the target. Can still be cast on units, but doesn't stack."]],"Skewer":["Description":["Magnus rushes forward, goring enemy units on his massive tusk.  Heroes hit on the way will be dragged to the destination, then damaged and slowed."]],"Reverse Polarity":["Description":["Magnus changes properties of matter, sucking all nearby enemies in front of him and stunning them with a powerful slam and dealing damage.rnrnUpgradable by Aghanim's Scepter."]]],"Timbersaw":["Whirling Death":["Description":["Timbersaw whirls extremely sharp edges, damaging enemies and destroying trees around him in an area.  If an enemy hero is affected, it loses some of its primary attribute for a short duration.  Whirling Death will deal Pure damage if a tree is cut down in the process."]],"Timber Chain":["Description":["Timbersaw fires a chain that embeds itself in the first tree it hits, pulling him towards it.  Any enemy in the path takes damage."]],"Reactive Armor":["Description":["Each time Timbersaw is attacked, he gains increased health regen and armor."]],"Chakram":["Description":["Fires your main saw blade at the target location where it will spin in place, dealing damage in an area around it.  Enemies caught in the saw blade will move more slowly for every 5% of health missing. The blade deals damage and cuts down trees in its path when fired and retracted.  While active the ability costs mana, and you lose the ability to attack.rnrnUpgradable by Aghanim's Scepter."]],"Return Chakram":["Description":["Returns the Chakram to Timbersaw."]]],"Bristleback":["Viscous Nasal Goo":["Description":["Covers a target in snot, causing it to have reduced armor and movement speed.  Multiple casts stack and refresh the duration.rnrnUpgradable by Aghanim's Scepter, making Goo an AoE ability that applies Goo to all enemies around you in a 600 radius."]],"Quill Spray":["Description":["Sprays enemy units with quills dealing damage in an area of effect around Bristleback.  Deals bonus damage for every time a unit was hit by Quill Spray in the last 14 seconds."]],"Bristleback":["Description":["Bristleback takes less damage if hit on the sides or rear.  If Bristleback takes 230 damage from the rear, he releases a Quill Spray of the current level."]],"Warpath":["Description":["Bristleback works himself up into a fury every time he casts a spell, increasing his movement speed and damage.rnrnUpgradable by Aghanim's Scepter."]]],"Tusk":["Ice Shards":["Description":["Tusk compresses shards of ice into a ball of frozen energy that damages all enemies it comes in contact with. When the ball reaches its target destination the shards are released, creating a barrier that lasts for 7 seconds."]],"Snowball":["Description":["Tusk begins rolling into a snowball. Allies within a 350 radius can also be added to the snowball by right-clicking on them, even while the snowball is moving. Once launched, any enemies caught in the snowball's path will be stunned and take damage. Each allied Hero in the snowball will add to its damage."]],"Frozen Sigil":["Description":["Tusk summons a Frozen Sigil by calling upon the deepest cold of winter. The Sigil creates a snowstorm which slows all enemy units within 600 range."]],"Launch Snowball":["Description":["Launch the snowball toward the target."]],"Walrus Kick":["Description":["Kicks the target unit back 900 units, damaging them and slowing their movement by 40% for 4 seconds."]],"Walrus PUNCH!":["Description":["Tusk connects with his mighty Walrus Punch, a critical strike so powerful it launches its victim into the air. The victim is slowed upon landing.rnrnUpgradable by Aghanim's Scepter."]]],"Skywrath_Mage":["Arcane Bolt":["Description":["Skywrath Mage launches a slow-moving bolt of arcane magic, dealing damage to an enemy unit based on Skywrath Mage's intelligence."]],"Concussive Shot":["Description":["Skywrath Mage sets off a long range shot that hits the closest hero within a long range.  Upon impact, it deals damage and slows in an area of effect."]],"Ancient Seal":["Description":["Skywrath Mage seals the targeted unit with an ancient rune, silencing it and causing it to take additional damage from spells."]],"Mystic Flare":["Description":["Skywrath Mage uses his ultimate magical ability to conjure a precise and violent mystical field that lays waste to his adversaries. Deals massive damage distributed evenly among any Heroes in the area over 2.4 seconds.rnrnUpgradable by Aghanim's Scepter."]]],"Abaddon":["Mist Coil":["Description":["Abaddon releases a coil of deathly mist that can damage an enemy unit or heal a friendly unit at the cost of some of Abaddon's health."]],"Aphotic Shield":["Description":["Summons dark energies around an ally unit, creating a shield that absorbs a set amount of damage before expiring. When the shield is destroyed it will burst and deal damage equal to the amount it could absorb to an area around it. Removes certain types of negative buffs and stuns on cast."]],"Curse of Avernus":["Description":["Abaddon strikes an enemy with chilling curse on each attack, causing all units who attack the slowed enemy to gain increased movement speed, along with faster attack speed, for a limited time."]],"Borrowed Time":["Description":["When activated, all damage dealt to you will heal instead of harm. Most negative buffs will also be removed. If the ability is not on cooldown, it will automatically activate if your health falls below 400.rnrnUpgradable by Aghanim's Scepter."]]],"Elder_Titan":["Echo Stomp":["Description":["Elder Titan and his Astral Spirit both stomp the ground, damaging and knocking nearby enemy units unconscious around their locations.  The Elder Titan stomp deals physical damage, while the Spirit stomp deals magical damage."]],"Astral Spirit":["Description":["Elder Titan sends forth his Astral Spirit, damaging any units it passes through.  When the spirit rejoins the Titan, it grants bonus damage and movement speed for each unit it damaged.rnrnThe Astral Spirit possesses the Echo Stomp, Return Spirit, and Natural Order abilities."]],"Natural Order":["Description":["Reduces all elements to their basic levels, removing base armor and magic damage resistance from nearby enemy units."]],"Return Astral Spirit":["Description":["Returns the Astral Spirit to Elder Titan."]],"Earth Splitter":["Description":["Sends forth a jagged crack in front of Elder Titan. After 3 seconds, the crack implodes, slowing movement while dealing damage to each enemy based on their maximum life. Half of the damage dealt is Magical damage, while the other half is Physical damage.rnrnUpgradable by Aghanim's Scepter."]]],"Legion_Commander":["Overwhelming Odds":["Description":["Turns the enemies' numbers against them, dealing damage and granting you bonus movement speed per unit or per hero.  Deals bonus damage to illusions and summoned units as a percent of their current health."]],"Press The Attack":["Description":["Removes debuffs and disables from the target friendly unit, and grants bonus attack speed and health regen for a short time."]],"Moment of Courage":["Description":["When attacked, Legion Commander has a chance to immediately counterattack with bonus lifesteal."]],"Duel":["Description":["Legion Commander and the target enemy hero are forced to attack each other for a short duration.  Neither hero can use items or abilities.  If either hero dies during the duration, the hero winning the Duel gains permanent bonus damage.rnrnUpgradable by Aghanim's Scepter."]]],"Ember_Spirit":["Searing Chains":["Description":["Ember Spirit unleashes fiery bolas that wrap around nearby enemies, anchoring them in place and dealing damage each second."]],"Sleight of Fist":["Description":["Ember Spirit dashes around with blazing speed, attacking all enemies in the targeted area of effect, then returning to his start location.  Deals bonus damage to heroes, and less damage to creeps."]],"Flame Guard":["Description":["Ember Spirit surrounds himself with a ring of fire that consumes incoming magic damage, leaving him unharmed.  Flame Guard deals damage per second in an area around Ember Spirit while Flame Guard is active.  If the shield is broken, the damage is also lost."]],"Activate Fire Remnant":["Description":["Select the Fire Remnant to arrive at."]],"Fire Remnant":["Description":["Ember Spirit generates Fire Remnant charges every 35 seconds, with a max of 3 charges.  Releasing a charge sends a Fire Remnant that runs to the target location at 2.5x Ember Spirit's speed.  Using Activate Fire Remnant, Ember Spirit can dash out to his Remnants, exploding them for area of effect damage.  The targeted Remnant will be arrived at last."]]],"Earth_Spirit":["Boulder Smash":["Description":["Earth Spirit smashes the target enemy or ally, sending them in the direction he is facing. If Earth Spirit targets an area, he will smash the nearest Stone Remnant in a 200 radius. The travelling unit or Remnant damages all enemy units it hits.  If an enemy is hit by a Stone Remnant, they are also stunned. Stone Remnants travel further than other units."]],"Rolling Boulder":["Description":["Earth Spirit gathers himself into a boulder and, after a 0.6s delay, rolls toward the target location, damaging enemy units. He will stop if he collides with an enemy hero or is stunned. If he rolls over a Stone Remnant, he will travel further and faster, and enemies hit by the boulder will have their movement speed slowed."]],"Geomagnetic Grip":["Description":["Earth Spirit pulls the target Stone Remnant. Enemies struck by the gripped target will be silenced, and take damage if the gripped target is a Stone Remnant."]],"Stone Remnant":["Description":["Call a Stone Remnant to the target location.  Stones Remnants have no vision and are invulnerable, and can be used with Earth Spirit's abilities.  Calling a Stone Remnant consumes a charge, which recharge over time."]],"Enchant Remnant":["Description":["Earth Spirit temporarily enchants a hero, granting them the properties of a Stone Remnant. After 3 seconds the remnant shatters, releasing the hero and damaging nearby enemies."]],"Magnetize":["Description":["Magnetizes units in a small nearby area, causing them to take damage for a short duration. Magnetized heroes cause nearby Stone Remnants to explode, destroying the remnant and refreshing Magnetize's duration on all nearby enemies. This process can repeat multiple times. If an enemy hero is affected by silence or slows as a result of Geomagnetic Grip or Rolling Boulder, all magnetized heroes share the effects.rnrnUpgradable by Aghanim's Scepter."]]],"Terrorblade":["Reflection":["Description":["Terrorblade brings forth an invulnerable dark reflection of all nearby enemy heroes. Affected enemy heroes are slowed and attacked by their reflection."]],"Conjure Image":["Description":["Creates an illusion of Terrorblade that deals damage."]],"Metamorphosis":["Description":["Terrorblade transforms into a powerful demon with a ranged attack. Any of Terrorblade's illusions that are within 900 range will also be transformed by Metamorphosis."]],"Sunder":["Description":["Severs the life from both Terrorblade and a target hero, exchanging a percentage of both units' current health. Some health points must remain."]]],"Phoenix":["Icarus Dive":["Description":["Phoenix dives forward in an arc with a fixed distance in the targeted direction, dealing damage over time and slowing the movement speed of any units it comes into contact with, and then orbiting back to its original position. If Phoenix casts Supernova, the dive ends."]],"Fire Spirits":["Description":["Summons 4 fire spirits that circle around Phoenix. Each spirit can be launched independently at a targeted area of effect. Affected enemy units take damage over time and have their attack speed greatly reduced."]],"Sun Ray":["Description":["Phoenix expels a beam of light at the cost of its own health. The beam damages enemies and heals allies for a base amount plus a percentage of their health. The percentage increases as the beam continues to fire."]],"Supernova":["Description":["The Phoenix willingly ends its current life for the chance to be reborn. Transforms into a burning sun that scorches enemies in a huge area. The sun can be destroyed by attacks from enemy Heroes. After 6 seconds the sun explodes, stunning all nearby enemies while restoring Phoenix to full health and mana with refreshed abilities.rnrnUpgradable by Aghanim's Scepter."]],"Launch Fire Spirit":["Description":["Each fire spirit can be launched independently at a targeted area of effect. Affected enemy units take damage over time and have their attack speed greatly reduced. Reveals the area it strikes for 1 second."]],"Stop Icarus Dive":["Description":["Immediately cancels the dive."]],"Stop Sun Ray":["Description":["Immediately stops the Sun Ray."]],"Toggle Movement":["Description":["Toggles slow forward movement during Sun Ray firing."]]],"Oracle":["Fortune's End":["Description":["CHANNELED - Gathers Oracle's power into a bolt of scouring energy that, when released, damages, stops movement, and purges enemies of buffs in an area around the target. If target is an ally it will only purge. Can be channeled for up to 2.5 seconds. The stop duration is equal to the time spent channeling."]],"Fate's Edict":["Description":["Oracle enraptures a target, disarming them and granting them 100% magic damage resistance. Can be cast on allies and enemies."]],"Purifying Flames":["Description":["Burns away impurities, dealing heavy magic damage to the target before causing them to regenerate health over time. The amount of health regenerated over its duration exceeds the amount of initial damage. Can be cast on enemies and allies."]],"False Promise":["Description":["Temporarily alters an ally's destiny, delaying any healing or damage taken until False Promise ends. Any healing that is delayed by False Promise is doubled. Removes most negative status effects and disables on initial cast."]]],"Techies":["Land Mines":["Description":["Plant an invisible mine that explodes when an enemy steps near.  The explosion will deal less damage if the enemy is farther away from the mine when it explodes.  Mines explode 0.3 seconds after being triggered.  Damages buildings."]],"Stasis Trap":["Description":["Plant an invisible trap that stuns nearby enemy units when triggered."]],"Suicide Squad, Attack!":["Description":["Techies sacrifice themselves for the greater good, dealing massive area of effect damage.  More damage is dealt to units closer to Techies when they explode.  Techies' respawn time is reduced by 50% when killed by this ability."]],"Focused Detonate":["Description":["Detonate all remote mines in the target area."]],"Minefield Sign":["Description":["Plant a warning sign to remind enemies to step lightly. Only one sign can exist at a time. Lasts 180 seconds.rnrnUpgradable by Aghanim's Scepter, allowing Minefield Sign to hide any Land Mines, Stasis Traps, and Remote Mines in a 125 radius from True Sight."]],"Remote Mines":["Description":["Plant an invisible explosive that will only detonate when triggered.  Does not damage buildings.rnrnUpgradable by Aghanim's Scepter."]]],"Winter_Wyvern":["Arctic Burn":["Description":["Winter Wyvern soars upon an arctic wind, granting her unobstructed movement and allowing her to exhale a blistering chill into each attack. While soaring, her attacks travel further and faster, and slow enemies with a magical freeze that strips them of 8% of their current health each second. Her sight is also hardened against night's chill, granting her 400% additional vision range at night while soaring."]],"Splinter Blast":["Description":["Launches a ball of brittle ice toward an enemy. The ice shatters on impact, leaving the primary target completely unaffected, while hurling damaging splinters into nearby enemies in a 500 radius. Enemies struck by these splinters are slowed by 25%."]],"Cold Embrace":["Description":["Encases an ally in an icy cocoon, freezing them solid while healing a base amount as well as a percentage of their maximum health each second. The cocoon blocks all physical damage."]],"Winter's Curse":["Description":["Winter Wyvern freezes an enemy in place while striking those nearby with a maddening curse which causes them to attack their frozen ally with increased attack speed. The frozen ally and those cursed to attack their ally are immune to all damage from their enemies."]]],"Arc_Warden":["Flux":["Description":["Infuses a lone enemy unit with swirling, volatile energy, slowing its movement speed and dealing damage over time. The effect is muted if another enemy unit is near the target."]],"Magnetic Field":["Description":["Generates a circular distortion field of magnetic energy that grants evasion and attack speed bonuses to allied heroes and buildings within."]],"Spark Wraith":["Description":["Summons a Spark Wraith that slowly materializes and patrols a targeted area until an enemy comes within its range. Once a target has been found the wraith fuses with them, dealing magical damage."]],"Tempest Double":["Description":["Briefly refocusing its fractured elements into a single form, the Arc Warden is able to create a perfect electrical duplication of itself. The duplicate can use all of Arc Warden's current items and spells. When the duplicate is created, all of its available items and normal abilities are off cooldown."]]]]